function [rArray,cArray,pArray,fArray,hArray,aArray,vArray,mArray]=init30(B,N,T)
    % 定义行数和列数
    rows = 30;

    % 生成全零的一维数组
    rArray = zeros(rows, 1);
    cArray = zeros(rows, 1);
    pArray = zeros(rows, 1);
    fArray = zeros(rows, 1);
    hArray = zeros(rows, 1);
    aArray = zeros(rows, 1);
    vArray = zeros(rows, 1);
    mArray = zeros(rows, 1);
    % 输入数据R
    rArray =  [819200,2662400,1564672,1359872,2785280,958464,1253376,2310144,2359296,1007616,2228224,2334720,1359872,2056192,2654208,1613824,2064384,1605632,2785280,2891776,3276800,3153920,950272,2031616,3088384,3014656,933888,2383872,3956736,2908160]';
    % kth设备上计算1bit所需的cpu周期
    
    cArray = [569,742,1097,982,1460,1019,1301,556,1152,1170,1460,937,1449,938,648,1486,1436,520,1094,577,909,1308,823,1124,1250,1129,1087,1064,1438,648]';
    % 一个cpu cycle所消耗的能量
    pArray = [0.0497e-12,0.1166e-11,0.1491e-19,0.1753e-16,0.1406e-16,0.0731e-15,0.0212e-18,0.0517e-13,0.1457e-15,0.0072e-19,0.1168e-14,0.1673e-18,0.1896e-11,0.1009e-17,0.0728e-14,0.1687e-19,0.1782e-14,0.0063e-19,0.0341e-17,0.1125e-12,0.0182e-17,0.1043e-19,0.0155e-15,0.0277e-19,0.0614e-26,0.1253e-16,0.0325e-17,0.0289e-11,0.0283e-17,0.0957e-16]';
    % kth设备的cpu能力
    
    fArray = [0.2000,0.1000,0.2000,0.1000,1.0000,0.6000,0.4000,0.3000,1.0000,0.6000,0.8000,1.0000,0.1000,0.1000,0.7000,0.4000,0.8000,0.7000,0.8000,0.7000,0.7000,0.5000,0.2000,0.6000,0.4000,0.4000,0.5000,0.8000,0.3000,0.3000]';
    fArray = fArray*1e9;

    % 模拟信道瑞利衰落
    
    hArray = [155,10,139,157,183,102,12,144,22,101,142,34,34,164,115,68,9,72,66,176,55,195,168,6,169,112,41,178,49,146]';

    %计算v
    for i = 1:30
       vArray(i) = B*cArray(i)*pArray(i)*hArray(i)*hArray(i)/N/log(2);
    end

    %计算优先级
    for i = 1:30
        if(vArray(i) < 1) 
            aArray(i) = 0.0;
        else 
            aArray(i) = N*(vArray(i)*log(vArray(i))-vArray(i)+1)/hArray(i)/hArray(i);
        end
    end
  
    for i = 1:30                                                   
        mArray(i) = rArray(i)- T*fArray(i) / cArray(i);
        if(mArray(i) < 0)
            mArray(i) = 0;
        end 
    end
    format long;
    %disp(mArray);
   
end




